; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=390, out_folder=./training, instance_id=90, seed=2114, goal_proportion=0.03

(define (problem blocksworld-90)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 b379 b380 b381 b382 b383 b384 b385 b386 b387 b388 b389 b390 - object)
 (:init 
    (arm-empty)
    (clear b31)
    (on-table b31)
    (clear b69)
    (on-table b69)
    (clear b156)
    (on-table b156)
    (clear b38)
    (on b38 b175)
    (on b175 b348)
    (on b348 b80)
    (on b80 b362)
    (on b362 b335)
    (on b335 b370)
    (on b370 b5)
    (on b5 b241)
    (on-table b241)
    (clear b251)
    (on b251 b82)
    (on b82 b374)
    (on-table b374)
    (clear b114)
    (on-table b114)
    (clear b233)
    (on b233 b328)
    (on-table b328)
    (clear b61)
    (on b61 b356)
    (on b356 b72)
    (on-table b72)
    (clear b116)
    (on b116 b344)
    (on b344 b217)
    (on b217 b387)
    (on b387 b347)
    (on-table b347)
    (clear b205)
    (on b205 b99)
    (on b99 b24)
    (on-table b24)
    (clear b308)
    (on b308 b282)
    (on-table b282)
    (clear b165)
    (on b165 b152)
    (on b152 b162)
    (on b162 b166)
    (on b166 b296)
    (on b296 b48)
    (on b48 b368)
    (on b368 b34)
    (on b34 b39)
    (on-table b39)
    (clear b127)
    (on b127 b280)
    (on b280 b15)
    (on b15 b101)
    (on b101 b32)
    (on b32 b149)
    (on-table b149)
    (clear b183)
    (on b183 b87)
    (on-table b87)
    (clear b366)
    (on b366 b36)
    (on b36 b302)
    (on b302 b54)
    (on b54 b185)
    (on-table b185)
    (clear b222)
    (on-table b222)
    (clear b57)
    (on b57 b151)
    (on b151 b264)
    (on-table b264)
    (clear b220)
    (on-table b220)
    (clear b53)
    (on-table b53)
    (clear b178)
    (on b178 b33)
    (on b33 b141)
    (on b141 b172)
    (on b172 b231)
    (on-table b231)
    (clear b240)
    (on-table b240)
    (clear b369)
    (on b369 b221)
    (on b221 b299)
    (on b299 b125)
    (on b125 b77)
    (on b77 b371)
    (on b371 b289)
    (on b289 b75)
    (on b75 b74)
    (on-table b74)
    (clear b242)
    (on b242 b130)
    (on b130 b270)
    (on-table b270)
    (clear b171)
    (on b171 b73)
    (on b73 b232)
    (on-table b232)
    (clear b339)
    (on b339 b122)
    (on b122 b59)
    (on b59 b215)
    (on-table b215)
    (clear b384)
    (on b384 b70)
    (on-table b70)
    (clear b84)
    (on b84 b354)
    (on b354 b336)
    (on b336 b62)
    (on-table b62)
    (clear b268)
    (on b268 b58)
    (on b58 b13)
    (on b13 b309)
    (on-table b309)
    (clear b68)
    (on b68 b129)
    (on b129 b167)
    (on-table b167)
    (clear b265)
    (on b265 b148)
    (on b148 b294)
    (on b294 b105)
    (on-table b105)
    (clear b292)
    (on b292 b315)
    (on b315 b91)
    (on b91 b163)
    (on b163 b30)
    (on b30 b169)
    (on b169 b313)
    (on b313 b197)
    (on b197 b318)
    (on b318 b322)
    (on-table b322)
    (clear b66)
    (on b66 b330)
    (on b330 b293)
    (on-table b293)
    (clear b40)
    (on b40 b223)
    (on b223 b196)
    (on b196 b298)
    (on-table b298)
    (clear b329)
    (on b329 b2)
    (on b2 b107)
    (on-table b107)
    (clear b247)
    (on b247 b214)
    (on b214 b42)
    (on b42 b206)
    (on b206 b204)
    (on b204 b257)
    (on b257 b184)
    (on b184 b139)
    (on b139 b193)
    (on b193 b81)
    (on b81 b154)
    (on-table b154)
    (clear b304)
    (on-table b304)
    (clear b47)
    (on b47 b261)
    (on-table b261)
    (clear b49)
    (on b49 b243)
    (on-table b243)
    (clear b301)
    (on b301 b343)
    (on b343 b246)
    (on b246 b199)
    (on b199 b250)
    (on b250 b160)
    (on-table b160)
    (clear b187)
    (on-table b187)
    (clear b349)
    (on b349 b182)
    (on b182 b290)
    (on b290 b355)
    (on-table b355)
    (clear b288)
    (on b288 b146)
    (on b146 b297)
    (on-table b297)
    (clear b324)
    (on-table b324)
    (clear b191)
    (on b191 b307)
    (on b307 b11)
    (on-table b11)
    (clear b136)
    (on b136 b285)
    (on b285 b342)
    (on b342 b188)
    (on b188 b259)
    (on b259 b363)
    (on b363 b164)
    (on b164 b19)
    (on-table b19)
    (clear b16)
    (on b16 b316)
    (on b316 b306)
    (on b306 b317)
    (on b317 b326)
    (on b326 b179)
    (on b179 b248)
    (on-table b248)
    (clear b147)
    (on b147 b63)
    (on b63 b340)
    (on b340 b96)
    (on b96 b213)
    (on b213 b37)
    (on-table b37)
    (clear b190)
    (on b190 b219)
    (on b219 b115)
    (on b115 b119)
    (on-table b119)
    (clear b89)
    (on b89 b287)
    (on b287 b44)
    (on b44 b253)
    (on b253 b225)
    (on b225 b52)
    (on-table b52)
    (clear b21)
    (on b21 b100)
    (on b100 b94)
    (on b94 b208)
    (on b208 b43)
    (on b43 b161)
    (on b161 b358)
    (on-table b358)
    (clear b90)
    (on b90 b117)
    (on b117 b106)
    (on b106 b26)
    (on b26 b267)
    (on-table b267)
    (clear b244)
    (on-table b244)
    (clear b325)
    (on-table b325)
    (clear b235)
    (on b235 b388)
    (on b388 b210)
    (on b210 b14)
    (on b14 b64)
    (on b64 b229)
    (on-table b229)
    (clear b218)
    (on b218 b8)
    (on b8 b276)
    (on b276 b386)
    (on b386 b103)
    (on-table b103)
    (clear b346)
    (on b346 b378)
    (on b378 b291)
    (on b291 b174)
    (on b174 b234)
    (on b234 b203)
    (on-table b203)
    (clear b236)
    (on b236 b351)
    (on-table b351)
    (clear b192)
    (on-table b192)
    (clear b155)
    (on b155 b332)
    (on b332 b23)
    (on b23 b85)
    (on b85 b385)
    (on b385 b255)
    (on-table b255)
    (clear b376)
    (on-table b376)
    (clear b157)
    (on b157 b41)
    (on b41 b104)
    (on-table b104)
    (clear b46)
    (on b46 b113)
    (on b113 b111)
    (on-table b111)
    (clear b375)
    (on-table b375)
    (clear b143)
    (on-table b143)
    (clear b25)
    (on-table b25)
    (clear b212)
    (on b212 b121)
    (on b121 b126)
    (on b126 b56)
    (on b56 b153)
    (on b153 b331)
    (on b331 b260)
    (on b260 b55)
    (on b55 b361)
    (on b361 b237)
    (on b237 b198)
    (on b198 b323)
    (on b323 b216)
    (on b216 b6)
    (on b6 b321)
    (on-table b321)
    (clear b312)
    (on b312 b45)
    (on b45 b311)
    (on b311 b389)
    (on b389 b60)
    (on b60 b168)
    (on b168 b364)
    (on b364 b274)
    (on b274 b159)
    (on b159 b131)
    (on b131 b158)
    (on-table b158)
    (clear b256)
    (on-table b256)
    (clear b277)
    (on b277 b135)
    (on b135 b209)
    (on b209 b252)
    (on b252 b142)
    (on b142 b83)
    (on b83 b194)
    (on b194 b227)
    (on-table b227)
    (clear b373)
    (on b373 b108)
    (on b108 b181)
    (on b181 b337)
    (on b337 b258)
    (on-table b258)
    (clear b140)
    (on b140 b4)
    (on b4 b27)
    (on b27 b224)
    (on-table b224)
    (clear b310)
    (on b310 b245)
    (on b245 b95)
    (on-table b95)
    (clear b144)
    (on b144 b314)
    (on-table b314)
    (clear b284)
    (on b284 b7)
    (on b7 b145)
    (on b145 b283)
    (on b283 b271)
    (on b271 b228)
    (on b228 b207)
    (on b207 b230)
    (on b230 b226)
    (on b226 b333)
    (on-table b333)
    (clear b93)
    (on b93 b176)
    (on b176 b9)
    (on b9 b118)
    (on b118 b338)
    (on-table b338)
    (clear b201)
    (on b201 b263)
    (on b263 b186)
    (on-table b186)
    (clear b350)
    (on b350 b86)
    (on b86 b88)
    (on b88 b180)
    (on b180 b98)
    (on b98 b357)
    (on b357 b97)
    (on-table b97)
    (clear b286)
    (on b286 b1)
    (on b1 b195)
    (on b195 b120)
    (on b120 b303)
    (on b303 b71)
    (on b71 b92)
    (on b92 b353)
    (on b353 b383)
    (on b383 b359)
    (on b359 b266)
    (on-table b266)
    (clear b278)
    (on b278 b211)
    (on b211 b367)
    (on b367 b177)
    (on b177 b238)
    (on b238 b133)
    (on b133 b20)
    (on-table b20)
    (clear b134)
    (on-table b134)
    (clear b10)
    (on b10 b305)
    (on b305 b377)
    (on-table b377)
    (clear b352)
    (on b352 b379)
    (on b379 b380)
    (on b380 b202)
    (on b202 b345)
    (on b345 b269)
    (on-table b269)
    (clear b200)
    (on b200 b17)
    (on b17 b365)
    (on b365 b137)
    (on b137 b320)
    (on-table b320)
    (clear b300)
    (on b300 b65)
    (on-table b65)
    (clear b189)
    (on b189 b281)
    (on b281 b360)
    (on b360 b18)
    (on b18 b76)
    (on-table b76)
    (clear b381)
    (on b381 b22)
    (on b22 b275)
    (on b275 b319)
    (on b319 b279)
    (on b279 b50)
    (on b50 b51)
    (on b51 b109)
    (on b109 b295)
    (on b295 b272)
    (on b272 b3)
    (on-table b3)
    (clear b334)
    (on-table b334)
    (clear b29)
    (on b29 b78)
    (on b78 b327)
    (on b327 b123)
    (on b123 b249)
    (on-table b249)
    (clear b150)
    (on-table b150)
    (clear b35)
    (on b35 b170)
    (on-table b170)
    (clear b12)
    (on-table b12)
    (clear b372)
    (on b372 b110)
    (on-table b110)
    (clear b67)
    (on b67 b79)
    (on b79 b132)
    (on-table b132)
    (clear b382)
    (on b382 b173)
    (on-table b173)
    (clear b273)
    (on b273 b128)
    (on b128 b102)
    (on-table b102)
    (clear b28)
    (on b28 b138)
    (on b138 b254)
    (on b254 b262)
    (on-table b262)
    (clear b390)
    (on-table b390)
    (clear b239)
    (on-table b239)
    (clear b341)
    (on-table b341)
    (clear b112)
    (on b112 b124)
    (on-table b124))
 (:goal  (and 
    (clear b11)
    (on-table b11)
    (clear b6)
    (on b6 b4)
    (on b4 b8)
    (on b8 b10)
    (on-table b10)
    (clear b2)
    (on-table b2)
    (clear b5)
    (on-table b5)
    (clear b3)
    (on-table b3)
    (clear b1)
    (on b1 b7)
    (on b7 b9)
    (on-table b9))))

; plan
1. (unstack b10 b305)
   deleted: (on b10 b305) (clear b10) (arm-empty)
   added: (holding b10) (clear b305)
   goals met: 2 of 17
2. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 3 of 17
3. (unstack b140 b4)
   deleted: (on b140 b4) (clear b140) (arm-empty)
   added: (holding b140) (clear b4)
   goals met: 3 of 17
4. (putdown b140)
   deleted: (holding b140)
   added: (clear b140) (arm-empty) (on-table b140)
   goals met: 3 of 17
5. (unstack b191 b307)
   deleted: (on b191 b307) (clear b191) (arm-empty)
   added: (holding b191) (clear b307)
   goals met: 3 of 17
6. (putdown b191)
   deleted: (holding b191)
   added: (clear b191) (arm-empty) (on-table b191)
   goals met: 3 of 17
7. (unstack b212 b121)
   deleted: (on b212 b121) (clear b212) (arm-empty)
   added: (holding b212) (clear b121)
   goals met: 3 of 17
8. (putdown b212)
   deleted: (holding b212)
   added: (clear b212) (arm-empty) (on-table b212)
   goals met: 3 of 17
9. (unstack b121 b126)
   deleted: (on b121 b126) (clear b121) (arm-empty)
   added: (holding b121) (clear b126)
   goals met: 3 of 17
10. (putdown b121)
   deleted: (holding b121)
   added: (clear b121) (arm-empty) (on-table b121)
   goals met: 3 of 17
11. (unstack b126 b56)
   deleted: (on b126 b56) (clear b126) (arm-empty)
   added: (holding b126) (clear b56)
   goals met: 3 of 17
12. (putdown b126)
   deleted: (holding b126)
   added: (clear b126) (arm-empty) (on-table b126)
   goals met: 3 of 17
13. (unstack b218 b8)
   deleted: (on b218 b8) (clear b218) (arm-empty)
   added: (holding b218) (clear b8)
   goals met: 3 of 17
14. (putdown b218)
   deleted: (holding b218)
   added: (clear b218) (arm-empty) (on-table b218)
   goals met: 3 of 17
15. (unstack b284 b7)
   deleted: (on b284 b7) (clear b284) (arm-empty)
   added: (holding b284) (clear b7)
   goals met: 3 of 17
16. (putdown b284)
   deleted: (holding b284)
   added: (clear b284) (arm-empty) (on-table b284)
   goals met: 3 of 17
17. (unstack b286 b1)
   deleted: (on b286 b1) (clear b286) (arm-empty)
   added: (holding b286) (clear b1)
   goals met: 4 of 17
18. (putdown b286)
   deleted: (holding b286)
   added: (clear b286) (arm-empty) (on-table b286)
   goals met: 4 of 17
19. (unstack b307 b11)
   deleted: (on b307 b11) (clear b307) (arm-empty)
   added: (holding b307) (clear b11)
   goals met: 5 of 17
20. (putdown b307)
   deleted: (holding b307)
   added: (clear b307) (arm-empty) (on-table b307)
   goals met: 5 of 17
21. (unstack b329 b2)
   deleted: (on b329 b2) (clear b329) (arm-empty)
   added: (holding b329) (clear b2)
   goals met: 6 of 17
22. (putdown b329)
   deleted: (holding b329)
   added: (clear b329) (arm-empty) (on-table b329)
   goals met: 6 of 17
23. (unstack b2 b107)
   deleted: (on b2 b107) (clear b2) (arm-empty)
   added: (holding b2) (clear b107)
   goals met: 5 of 17
24. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 17
25. (unstack b38 b175)
   deleted: (on b38 b175) (clear b38) (arm-empty)
   added: (holding b38) (clear b175)
   goals met: 7 of 17
26. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 7 of 17
27. (unstack b175 b348)
   deleted: (on b175 b348) (clear b175) (arm-empty)
   added: (holding b175) (clear b348)
   goals met: 7 of 17
28. (putdown b175)
   deleted: (holding b175)
   added: (clear b175) (arm-empty) (on-table b175)
   goals met: 7 of 17
29. (unstack b348 b80)
   deleted: (on b348 b80) (clear b348) (arm-empty)
   added: (holding b348) (clear b80)
   goals met: 7 of 17
30. (putdown b348)
   deleted: (holding b348)
   added: (clear b348) (arm-empty) (on-table b348)
   goals met: 7 of 17
31. (unstack b381 b22)
   deleted: (on b381 b22) (clear b381) (arm-empty)
   added: (holding b381) (clear b22)
   goals met: 7 of 17
32. (putdown b381)
   deleted: (holding b381)
   added: (clear b381) (arm-empty) (on-table b381)
   goals met: 7 of 17
33. (unstack b22 b275)
   deleted: (on b22 b275) (clear b22) (arm-empty)
   added: (holding b22) (clear b275)
   goals met: 7 of 17
34. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 7 of 17
35. (unstack b275 b319)
   deleted: (on b275 b319) (clear b275) (arm-empty)
   added: (holding b275) (clear b319)
   goals met: 7 of 17
36. (putdown b275)
   deleted: (holding b275)
   added: (clear b275) (arm-empty) (on-table b275)
   goals met: 7 of 17
37. (unstack b319 b279)
   deleted: (on b319 b279) (clear b319) (arm-empty)
   added: (holding b319) (clear b279)
   goals met: 7 of 17
38. (putdown b319)
   deleted: (holding b319)
   added: (clear b319) (arm-empty) (on-table b319)
   goals met: 7 of 17
39. (unstack b279 b50)
   deleted: (on b279 b50) (clear b279) (arm-empty)
   added: (holding b279) (clear b50)
   goals met: 7 of 17
40. (putdown b279)
   deleted: (holding b279)
   added: (clear b279) (arm-empty) (on-table b279)
   goals met: 7 of 17
41. (unstack b50 b51)
   deleted: (on b50 b51) (clear b50) (arm-empty)
   added: (holding b50) (clear b51)
   goals met: 7 of 17
42. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 7 of 17
43. (unstack b51 b109)
   deleted: (on b51 b109) (clear b51) (arm-empty)
   added: (holding b51) (clear b109)
   goals met: 7 of 17
44. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 7 of 17
45. (unstack b109 b295)
   deleted: (on b109 b295) (clear b109) (arm-empty)
   added: (holding b109) (clear b295)
   goals met: 7 of 17
46. (putdown b109)
   deleted: (holding b109)
   added: (clear b109) (arm-empty) (on-table b109)
   goals met: 7 of 17
47. (unstack b295 b272)
   deleted: (on b295 b272) (clear b295) (arm-empty)
   added: (holding b295) (clear b272)
   goals met: 7 of 17
48. (putdown b295)
   deleted: (holding b295)
   added: (clear b295) (arm-empty) (on-table b295)
   goals met: 7 of 17
49. (unstack b272 b3)
   deleted: (on b272 b3) (clear b272) (arm-empty)
   added: (holding b272) (clear b3)
   goals met: 8 of 17
50. (putdown b272)
   deleted: (holding b272)
   added: (clear b272) (arm-empty) (on-table b272)
   goals met: 8 of 17
51. (unstack b56 b153)
   deleted: (on b56 b153) (clear b56) (arm-empty)
   added: (holding b56) (clear b153)
   goals met: 8 of 17
52. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 8 of 17
53. (unstack b153 b331)
   deleted: (on b153 b331) (clear b153) (arm-empty)
   added: (holding b153) (clear b331)
   goals met: 8 of 17
54. (putdown b153)
   deleted: (holding b153)
   added: (clear b153) (arm-empty) (on-table b153)
   goals met: 8 of 17
55. (unstack b331 b260)
   deleted: (on b331 b260) (clear b331) (arm-empty)
   added: (holding b331) (clear b260)
   goals met: 8 of 17
56. (putdown b331)
   deleted: (holding b331)
   added: (clear b331) (arm-empty) (on-table b331)
   goals met: 8 of 17
57. (unstack b260 b55)
   deleted: (on b260 b55) (clear b260) (arm-empty)
   added: (holding b260) (clear b55)
   goals met: 8 of 17
58. (putdown b260)
   deleted: (holding b260)
   added: (clear b260) (arm-empty) (on-table b260)
   goals met: 8 of 17
59. (unstack b55 b361)
   deleted: (on b55 b361) (clear b55) (arm-empty)
   added: (holding b55) (clear b361)
   goals met: 8 of 17
60. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 8 of 17
61. (unstack b361 b237)
   deleted: (on b361 b237) (clear b361) (arm-empty)
   added: (holding b361) (clear b237)
   goals met: 8 of 17
62. (putdown b361)
   deleted: (holding b361)
   added: (clear b361) (arm-empty) (on-table b361)
   goals met: 8 of 17
63. (unstack b237 b198)
   deleted: (on b237 b198) (clear b237) (arm-empty)
   added: (holding b237) (clear b198)
   goals met: 8 of 17
64. (putdown b237)
   deleted: (holding b237)
   added: (clear b237) (arm-empty) (on-table b237)
   goals met: 8 of 17
65. (unstack b198 b323)
   deleted: (on b198 b323) (clear b198) (arm-empty)
   added: (holding b198) (clear b323)
   goals met: 8 of 17
66. (putdown b198)
   deleted: (holding b198)
   added: (clear b198) (arm-empty) (on-table b198)
   goals met: 8 of 17
67. (unstack b323 b216)
   deleted: (on b323 b216) (clear b323) (arm-empty)
   added: (holding b323) (clear b216)
   goals met: 8 of 17
68. (putdown b323)
   deleted: (holding b323)
   added: (clear b323) (arm-empty) (on-table b323)
   goals met: 8 of 17
69. (unstack b216 b6)
   deleted: (on b216 b6) (clear b216) (arm-empty)
   added: (holding b216) (clear b6)
   goals met: 9 of 17
70. (putdown b216)
   deleted: (holding b216)
   added: (clear b216) (arm-empty) (on-table b216)
   goals met: 9 of 17
71. (unstack b80 b362)
   deleted: (on b80 b362) (clear b80) (arm-empty)
   added: (holding b80) (clear b362)
   goals met: 9 of 17
72. (putdown b80)
   deleted: (holding b80)
   added: (clear b80) (arm-empty) (on-table b80)
   goals met: 9 of 17
73. (unstack b362 b335)
   deleted: (on b362 b335) (clear b362) (arm-empty)
   added: (holding b362) (clear b335)
   goals met: 9 of 17
74. (putdown b362)
   deleted: (holding b362)
   added: (clear b362) (arm-empty) (on-table b362)
   goals met: 9 of 17
75. (unstack b335 b370)
   deleted: (on b335 b370) (clear b335) (arm-empty)
   added: (holding b335) (clear b370)
   goals met: 9 of 17
76. (putdown b335)
   deleted: (holding b335)
   added: (clear b335) (arm-empty) (on-table b335)
   goals met: 9 of 17
77. (unstack b370 b5)
   deleted: (on b370 b5) (clear b370) (arm-empty)
   added: (holding b370) (clear b5)
   goals met: 10 of 17
78. (putdown b370)
   deleted: (holding b370)
   added: (clear b370) (arm-empty) (on-table b370)
   goals met: 10 of 17
79. (unstack b5 b241)
   deleted: (on b5 b241) (clear b5) (arm-empty)
   added: (holding b5) (clear b241)
   goals met: 9 of 17
80. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 11 of 17
81. (unstack b93 b176)
   deleted: (on b93 b176) (clear b93) (arm-empty)
   added: (holding b93) (clear b176)
   goals met: 11 of 17
82. (putdown b93)
   deleted: (holding b93)
   added: (clear b93) (arm-empty) (on-table b93)
   goals met: 11 of 17
83. (unstack b176 b9)
   deleted: (on b176 b9) (clear b176) (arm-empty)
   added: (holding b176) (clear b9)
   goals met: 11 of 17
84. (putdown b176)
   deleted: (holding b176)
   added: (clear b176) (arm-empty) (on-table b176)
   goals met: 11 of 17
85. (unstack b9 b118)
   deleted: (on b9 b118) (clear b9) (arm-empty)
   added: (holding b9) (clear b118)
   goals met: 11 of 17
86. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 12 of 17
87. (unstack b4 b27)
   deleted: (on b4 b27) (clear b4) (arm-empty)
   added: (holding b4) (clear b27)
   goals met: 12 of 17
88. (stack b4 b8)
   deleted: (clear b8) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b8)
   goals met: 13 of 17
89. (unstack b7 b145)
   deleted: (on b7 b145) (clear b7) (arm-empty)
   added: (holding b7) (clear b145)
   goals met: 13 of 17
90. (stack b7 b9)
   deleted: (clear b9) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b9)
   goals met: 14 of 17
91. (unstack b1 b195)
   deleted: (on b1 b195) (clear b1) (arm-empty)
   added: (holding b1) (clear b195)
   goals met: 13 of 17
92. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 15 of 17
93. (unstack b4 b8)
   deleted: (on b4 b8) (clear b4) (arm-empty)
   added: (holding b4) (clear b8)
   goals met: 14 of 17
94. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 14 of 17
95. (unstack b8 b276)
   deleted: (on b8 b276) (clear b8) (arm-empty)
   added: (holding b8) (clear b276)
   goals met: 14 of 17
96. (stack b8 b10)
   deleted: (clear b10) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b10)
   goals met: 15 of 17
97. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 15 of 17
98. (stack b4 b8)
   deleted: (clear b8) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b8)
   goals met: 16 of 17
99. (unstack b6 b321)
   deleted: (on b6 b321) (clear b6) (arm-empty)
   added: (holding b6) (clear b321)
   goals met: 15 of 17
100. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 17 of 17
